Revit 2016 API
FabricSheetLayoutPattern Enumeration
 The pattern for how the wires in Fabric Sheet are laid out.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public enum FabricSheetLayoutPattern
Visual Basic
Public Enumeration FabricSheetLayoutPattern
Visual C++
public enum class FabricSheetLayoutPattern
Members
Member name | Description
ActualSpacing |  The spacing between the rebars is fixed and specified by input.
FixedNumber |  The spacing between the rebars is adjustable, but the number of bars is constant based on input.
MaximumSpacing |  The maximum distance between the rebars is specified by input, and the number of rebars changes based on the length of rebar set.
NumberWithSpacing |  Both the spacing between the rebars and the number of rebars are constant based on input.
See Also
Autodesk.Revit.DB.Structure Namespace